define('dataSource', function() {
    var dataSource = {
        articleData: {
            dataList: [
                {
                    title: '2018年总结',
                    fromWord: '时间总是很快',
                    context: [
                        '时间总是很快，转眼间已经18年底了，终于抽了点时间记录下今年的变化。。', 
                        '今年3月5日，【终于】踏进了北京的土地，离开了学习生活近5年的沈阳。这期间做了无数的思想斗争，到底要不要来北京发展，毕竟新的环境会让我感到不安，最终还是下了决定。现在依稀记得沈阳的冬天是那么的冷。回忆着学校楼下的烤面筋，当年风风火火的兴顺夜市。',
                        '来北京的第一天，下午5点半自己提着大大小小的行李走出了陌生的北京站，一脸茫然。虽然很累但是内心却是满腔热血。从此开始了【北漂】生活。北京是一座充满了人才与竞争的地方，每天都有怀揣着梦想的青年踏入，初衷都是想实现自己的梦想，有的人的梦想是金钱，有的人是人脉，有的是能力。记得实习时部门的年会宣传语是【不忘初心，砥砺前行】，我觉得说的很好，希望我不忘【初心】。',
                        '18年一直在适应工作与环境，好久没有踏踏实实的系统的学习，年中时想把好多技术学习下也没有时间，嘴里说了好久的故宫也没有去看看。元旦前争取把18年的【遗留问题】解决。',
                        '提起元旦心里总是很高兴，终于可以吃到老妈做的家乡菜了。'
                    ]
                }
            ]
        }
    }
    return dataSource
})