define('dataSource', function() {
    var dataSource = {
        articleData: {
            dataList: [
                {
                    title: '2018年总结',
                    fromWord: '时间总是很快',
                    context: [
                        '时间总是很快，转眼间已经18年底了，终于抽了点时间记录下今年的变化。。', 
                        '3月5日，终于踏进了北京的土地，离开了学习生活5年的沈阳。这期间做了无数的思想斗争，到底要不要来北京发展，毕竟新的环境会让我感到不安，最终还是下了决定。',
                        '来到北京后第一家公司很幸运的遇到了北京的第一批朋友和同事，遇到了人生的第二位伯乐(第一位后面再说), 虽是和之前沈阳同样的技术方向但是项目的健壮性却截不同，第一次见识到了对某一技术的深入使用，第一次见到了对项目流程的严控把关，第一次对整个团队协作有了更好的理解。公司里的leader翔哥是位刚刚喜得千金的大哥，尊称翔哥，至今我都很佩服我的2位人生伯乐因为他们对技术都有着令人倾佩的高度。我也想着我也要成为他们那样的人。',
                        '慢慢的，自己和公司的同事越来越熟悉，对公司的项目也更得心应手，自己已经没有了刚到北京的那种陌生感，每天工作的都很高兴，孜孜不倦的产出新鲜的需求。自己的技术能力也越来越好些，之前不稳固的技术也熟悉了很多，在翔哥的带领下还学习了很多node的技术至今难忘。但是9个月过去了我心里沉睡的想法又出现了，那就是刚来北京时我默默对自己提出的要求--进入一线的互联网公司，刚来北京时其实自己的能力并不达到要求，自己信心满满的试了很多次，最后都放弃了慢慢的想法也就淡了些。',
                        '11月底，偶然的机会下顺利的进入了百度，满足了自己的“梦想”。' 
                    ]
                }
            ]
        }
    }
    return dataSource
})